src/test/resources/leanapps/getPolicyCheckResponse.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
	<env:Header />
	<env:Body>
		<ns:getPoliciesBody xmlns:ns="http://www.leanapps.com/businesslayer/xml">
			<ns:policiesBody>
				<ns:parties>
					<ns:party xsi:type="ns:Intermediary"
						xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
						<ns:id>
							<ns:oid>11600595</ns:oid>
							<ns:key>20000541</ns:key>
							<ns:updateCt>2</ns:updateCt>
						</ns:id>
						<ns:startDate>2009-11-15+01:00</ns:startDate>
						<ns:addresses>
							<ns:address xsi:type="ns:PostalAddress">
								<ns:id>
									<ns:oid>11600596</ns:oid>
									<ns:updateCt>2</ns:updateCt>
								</ns:id>
								<ns:startDate>2009-11-15+01:00</ns:startDate>
								<ns:isDefault>true</ns:isDefault>
								<ns:street>
									<ns:streetName>Trumandreef</ns:streetName>
									<ns:streetNumber>3</ns:streetNumber>
								</ns:street>
								<ns:zipCode>6716 DH</ns:zipCode>
								<ns:city>EDE GLD</ns:city>
								<ns:countryCode>NL</ns:countryCode>
								<ns:phone>06-14399317</ns:phone>
								<ns:email>info@boukesfinancieeladvies.nl</ns:email>
							</ns:address>
						</ns:addresses>
						<ns:accounts>
							<ns:account xsi:type="ns:PostalGiroAccount">
								<ns:id>
									<ns:oid>11600597</ns:oid>
									<ns:key>BA11828</ns:key>
									<ns:updateCt>2</ns:updateCt>
								</ns:id>
								<ns:startDate>2009-11-15+01:00</ns:startDate>
								<ns:accountNumber>3327654</ns:accountNumber>
								<ns:paymentMethod>REMITTANCE</ns:paymentMethod>
								<ns:collectionMethod>AUTOMATIC_COLLECTION</ns:collectionMethod>
								<ns:isDefault>true</ns:isDefault>
								<ns:bankAccountElevenCheck>false</ns:bankAccountElevenCheck>
							</ns:account>
						</ns:accounts>
						<ns:fictional>false</ns:fictional>
						<ns:lastName>Houkes Financieel Advies</ns:lastName>
						<ns:colorGroupId>1</ns:colorGroupId>
						<ns:indVaCwap>false</ns:indVaCwap>
						<ns:indIFN>false</ns:indIFN>
						<ns:inspectorNr>588</ns:inspectorNr>
					</ns:party>
					<ns:party xsi:type="ns:Person"
						xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
						<ns:id>
							<ns:oid>31039376</ns:oid>
							<ns:key>8479185971</ns:key>
							<ns:updateCt>1</ns:updateCt>
						</ns:id>
						<ns:startDate>2012-09-24+02:00</ns:startDate>
						<ns:addresses>
							<ns:address xsi:type="ns:PostalAddress">
								<ns:id>
									<ns:oid>31039377</ns:oid>
									<ns:updateCt>1</ns:updateCt>
								</ns:id>
								<ns:startDate>2012-09-24+02:00</ns:startDate>
								<ns:isDefault>true</ns:isDefault>
								<ns:street>
									<ns:streetName>Strawinskypad</ns:streetName>
									<ns:streetNumber>100</ns:streetNumber>
								</ns:street>
								<ns:zipCode>1323 PZ</ns:zipCode>
								<ns:city>Almere</ns:city>
								<ns:countryCode>DE</ns:countryCode>
								<ns:phone>036-5432119</ns:phone>
							</ns:address>
						</ns:addresses>
						<ns:accounts>
							<ns:account xsi:type="ns:PostalGiroAccount">
								<ns:id>
									<ns:oid>31039378</ns:oid>
									<ns:key>BA82844</ns:key>
									<ns:updateCt>1</ns:updateCt>
								</ns:id>
								<ns:startDate>2012-09-24+02:00</ns:startDate>
								<ns:accountNumber>15321</ns:accountNumber>
								<ns:paymentMethod>COLLECTION_ONLY_CHEQUE</ns:paymentMethod>
								<ns:collectionMethod>AUTOMATIC_COLLECTION</ns:collectionMethod>
								<ns:city>Woerden</ns:city>
								<ns:isDefault>true</ns:isDefault>
								<ns:bankAccountElevenCheck>false</ns:bankAccountElevenCheck>
							</ns:account>
						</ns:accounts>
						<ns:fictional>false</ns:fictional>
						<ns:initials>V.L.</ns:initials>
						<ns:lastName>Verkade</ns:lastName>
						<ns:gender>MALE</ns:gender>
						<ns:dateOfBirth>1965-01-21+01:00</ns:dateOfBirth>
					</ns:party>
					<ns:party xsi:type="ns:Person"
						xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
						<ns:id>
							<ns:oid>31039379</ns:oid>
							<ns:key>8479185970</ns:key>
							<ns:updateCt>1</ns:updateCt>
						</ns:id>
						<ns:startDate>2012-09-24+02:00</ns:startDate>
						<ns:addresses>
							<ns:address xsi:type="ns:PostalAddress">
								<ns:id>
									<ns:oid>31039380</ns:oid>
									<ns:updateCt>1</ns:updateCt>
								</ns:id>
								<ns:startDate>2012-09-24+02:00</ns:startDate>
								<ns:isDefault>true</ns:isDefault>
								<ns:street>
									<ns:streetName>Strawinskypad</ns:streetName>
									<ns:streetNumber>100</ns:streetNumber>
								</ns:street>
								<ns:zipCode>1323 PZ</ns:zipCode>
								<ns:city>Almere</ns:city>
								<ns:countryCode>NL</ns:countryCode>
								<ns:phone>036-5432119</ns:phone>
							</ns:address>
						</ns:addresses>
						<ns:accounts>
							<ns:account xsi:type="ns:PostalGiroAccount">
								<ns:id>
									<ns:oid>31039381</ns:oid>
									<ns:key>BA82845</ns:key>
									<ns:updateCt>1</ns:updateCt>
								</ns:id>
								<ns:startDate>2012-09-24+02:00</ns:startDate>
								<ns:accountNumber>15321</ns:accountNumber>
								<ns:paymentMethod>COLLECTION_ONLY_CHEQUE</ns:paymentMethod>
								<ns:collectionMethod>AUTOMATIC_COLLECTION</ns:collectionMethod>
								<ns:city>Woerden</ns:city>
								<ns:isDefault>true</ns:isDefault>
								<ns:bankAccountElevenCheck>false</ns:bankAccountElevenCheck>
							</ns:account>
						</ns:accounts>
						<ns:fictional>false</ns:fictional>
						<ns:initials>F</ns:initials>
						<ns:firstName>Fried</ns:firstName>
						<ns:middleName>van</ns:middleName>
						<ns:lastName>Hoeben</ns:lastName>
						<ns:gender>FEMALE</ns:gender>
						<ns:dateOfBirth>1965-01-29+01:00</ns:dateOfBirth>
					</ns:party>
				</ns:parties>
				<ns:policies>
					<ns:policy>
						<ns:id>
							<ns:oid>31284459</ns:oid>
							<ns:key>134424</ns:key>
							<ns:updateCt>1</ns:updateCt>
						</ns:id>
						<ns:insurances>
							<ns:insurance>
								<ns:id>
									<ns:oid>31284460</ns:oid>
									<ns:key>
										<ns:sequenceNr>1</ns:sequenceNr>
										<ns:versionNr>1</ns:versionNr>
									</ns:key>
									<ns:updateCt>5</ns:updateCt>
								</ns:id>
								<ns:product>
									<ns:productKey>YNVKCAR</ns:productKey>
								</ns:product>
								<ns:dates>
									<ns:startDate>2012-11-01+01:00</ns:startDate>
									<ns:alterationDate>2012-11-01+01:00</ns:alterationDate>
									<ns:lifeLong>true</ns:lifeLong>
								</ns:dates>
								<ns:roles>
									<ns:role xsi:type="ns:InsurancePolicyHolder"
										xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
										<ns:id>
											<ns:oid>31284469</ns:oid>
											<ns:updateCt>1</ns:updateCt>
										</ns:id>
										<ns:partyId>
											<ns:oid>31039376</ns:oid>
											<ns:key>8479185971</ns:key>
										</ns:partyId>
									</ns:role>
									<ns:role xsi:type="ns:InsuranceInsured"
										xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
										<ns:id>
											<ns:oid>31284470</ns:oid>
											<ns:updateCt>1</ns:updateCt>
										</ns:id>
										<ns:partyId>
											<ns:oid>31039379</ns:oid>
											<ns:key>8479185970</ns:key>
										</ns:partyId>
										<ns:continuationAfterDeath>true</ns:continuationAfterDeath>
									</ns:role>
									<ns:role xsi:type="ns:InsuranceIntermediary"
										xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
										<ns:id>
											<ns:oid>31284471</ns:oid>
											<ns:updateCt>1</ns:updateCt>
										</ns:id>
										<ns:partyId>
											<ns:oid>11600595</ns:oid>
											<ns:key>20000541</ns:key>
										</ns:partyId>
									</ns:role>
								</ns:roles>
								<ns:insuranceAccount>
									<ns:id>
										<ns:oid>31284461</ns:oid>
										<ns:key>IAC199706</ns:key>
										<ns:updateCt>1</ns:updateCt>
									</ns:id>
									<ns:fundAccounts>
										<ns:fundAccount>
											<ns:id>
												<ns:oid>31284468</ns:oid>
												<ns:updateCt>2</ns:updateCt>
											</ns:id>
											<ns:productFundKey>YNVKCAR_F3.0</ns:productFundKey>
											<ns:externalAccountNr xsi:nil="true"
												xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" />
											<ns:startUnits>0.0</ns:startUnits>
											<ns:conversionValue>0.0</ns:conversionValue>
											<ns:guaranteeReserve>0.0</ns:guaranteeReserve>
											<ns:userDefinedIndividualYield>0.03
											</ns:userDefinedIndividualYield>
											<ns:units>-1.98195009</ns:units>
										</ns:fundAccount>
									</ns:fundAccounts>
								</ns:insuranceAccount>
								<ns:singlePremiums>
									<ns:singlePremium>
										<ns:id>
											<ns:oid>31284477</ns:oid>
											<ns:updateCt>2</ns:updateCt>
										</ns:id>
										<ns:amount>3390.54</ns:amount>
										<ns:premiumPayers>
											<ns:premiumPayer>
												<ns:id>
													<ns:oid>31284484</ns:oid>
													<ns:updateCt>1</ns:updateCt>
												</ns:id>
												<ns:partyId>
													<ns:oid>31039376</ns:oid>
													<ns:key>8479185971</ns:key>
												</ns:partyId>
												<ns:bankAccountId>
													<ns:oid>31039378</ns:oid>
													<ns:key>BA82844</ns:key>
												</ns:bankAccountId>
												<ns:factor>1.0</ns:factor>
												<ns:collectionMethod>AUTOMATIC_COLLECTION
												</ns:collectionMethod>
											</ns:premiumPayer>
										</ns:premiumPayers>
									</ns:singlePremium>
								</ns:singlePremiums>
								<ns:deathCoverages>
									<ns:deathCoverage xsi:type="ns:FixedDeathCoverage"
										xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
										<ns:id>
											<ns:oid>31284480</ns:oid>
											<ns:updateCt>1</ns:updateCt>
										</ns:id>
										<ns:coverageSpecKey>YNVKCAR_MP</ns:coverageSpecKey>
										<ns:startDate>2012-11-01+01:00</ns:startDate>
										<ns:insured>
											<ns:id>
												<ns:oid>31284481</ns:oid>
												<ns:updateCt>1</ns:updateCt>
											</ns:id>
											<ns:partyId>
												<ns:oid>31039379</ns:oid>
												<ns:key>8479185970</ns:key>
											</ns:partyId>
										</ns:insured>
										<ns:amount>7000.0</ns:amount>
									</ns:deathCoverage>
								</ns:deathCoverages>
								<ns:attributes>
									<ns:attribute>
										<ns:id>
											<ns:oid>31284472</ns:oid>
											<ns:updateCt>1</ns:updateCt>
										</ns:id>
										<ns:specificationKey>NO_POLICY</ns:specificationKey>
										<ns:boolean>false</ns:boolean>
									</ns:attribute>
									<ns:attribute>
										<ns:id>
											<ns:oid>31284473</ns:oid>
											<ns:updateCt>1</ns:updateCt>
										</ns:id>
										<ns:specificationKey>LEDENK</ns:specificationKey>
										<ns:number>10.0</ns:number>
									</ns:attribute>
								</ns:attributes>
							</ns:insurance>
						</ns:insurances>
					</ns:policy>
				</ns:policies>
			</ns:policiesBody>
			<ns:status>
				<ns:status>OK</ns:status>
			</ns:status>
		</ns:getPoliciesBody>
	</env:Body>
</env:Envelope>
